Revit 2024 API
IFCData.HasValue Property
 Identifies if the data is empty or contains a value.
Namespace: Autodesk.Revit.DB.IFC
Assembly: RevitAPIIFC (in RevitAPIIFC.dll) Version: 24.0.0.0 (24.0.0.0)
Since: 2013
Syntax
C#
public bool HasValue { get; }
Visual Basic
Public ReadOnly Property HasValue As Boolean
	Get
Visual C++
public:
property bool HasValue {
	bool get ();
}
See Also
IFCData Class
Autodesk.Revit.DB.IFC Namespace